Repository: maksuturva/woocommerce_payment_module
Catalog: languages/wc-maksuturva-*.po
Languages: fi

source: Shipping cost
fi: Toimituskulut

source: Discount
fi: Alennus

source: Payment handling fee
fi: Laskutuslisä

source: Take payments via Svea.
fi: Vastaanota maksuja Svean kautta.

source: Enable/Disable
fi: Ota käyttöön / poista käytöstä

source: Enable Svea Payments Gateway
fi: Käytä Svea Payments maksupalvelua

source: Title
fi: Otsikko

source: This controls the title which the user sees during checkout.
fi: Tämä otsikko näkyy käyttäjälle kassalla.

source: Customer Message
fi: Viesti käyttäjälle

source: This message is shown below the payment method on the checkout page.
fi: Tämä viesti näkyy maksukäytävävalinnan alapuolella kassalla.

source: Add new
fi: Lisää uusi

source: Handling cost amount
fi: Laskutuslisän suuruus

source: Payment method code
fi: Maksutavan koodi

source: Payment method handling costs
fi: Maksutapojen laskutuslisät

source: Remove selected rows
fi: Poista valitut rivit

source: Payment handling fees
fi: Laskutuslisät

source: Payment handling fees tax class
fi: Laskutuslisien veroluokka

source: Tax class determines the tax percentage used for the payment handling fees.
fi: Veroluokan perusteella lasketaan laskutuslisän veron määrä.

source: Pay via Svea.
fi: Svea Payments maksu

source: Account settings
fi: Tiliasetukset

source: Testing instructions
fi: Testausohjeet

source: Seller id
fi: Kauppiastunnus

source: The seller identification provided by Svea upon your registration.
fi: Kauppiastunnus, jonka saa rekisteröityessä Sveaan kauppiaaksi.

source: Secret Key
fi: Salainen avain

source: Your unique secret key provided by Svea.
fi: Svean toimittama salainen avain

source: Secret Key Version
fi: Salaisen avaimen versio

source: The version of the secret key provided by Svea.
fi: Svean toimittaman avaimen versio.

source: Advanced settings
fi: Lisäasetukset

source: Gateway URL
fi: Välityspalvelun URL

source: The URL used to communicate with Svea. Do not change this configuration unless you know what you are doing.
fi: URL, jota käytetään Svean kanssa. Yleensä tätä ei pidä muuttaa.

source: Payment Prefix
fi: Maksun etuliite

source: Prefix for order identifiers. Can be used to generate unique payment ids after e.g. reinstall.
fi: Maksun etuosa, joka lisätään maksutapahtuman numeroon. Voidaan käyttää yksilöimään maksutapahtumat esimerkiksi Woocommercen uudelleenasennuksen jälkeen, mikäli Svea palauttaa virheitä päällekkäisistä tilausnumeroista.

source: Send delivery confirmation on status change to status
fi: Lähetä toimitustiedot kun maksun tila muuttuu tilaan

source: Send delivery confirmation to Svea when this status is selected.
fi: Lähetä toimitustiedot Svealle kun tilauksen tila muuttuu tässä määriteltyyn tilaan.

source: Send delivery confirmation only for specific payment methods
fi: Välitä toimitustieto vain valituista maksutavoista

source: Add payment method codes (for example FI70,FI71,FI72). If this field is left empty, the selected delivery confirmation is sent on all orders paid with any payment method. If the payment method codes are added, the selected delivery confirmation is sent only on orders paid with specific payment methods.
fi: Lisää maksutapakoodit (esim. FI70,FI71,FI72). Mikäli tämä kenttä jätetään tyhjäksi, toimitustiedot välitetään kaikista tilauksista riippumatta maksutavasta. Jos maksutapakoodit lisätään, toimitustiedot välitetään ainoastaan tilauksista, jotka on maksettu valituilla maksutavoilla.

source: Svea encoding
fi: Merkistöenkoodaus

source: The encoding used for Svea.
fi: Merkistöenkoodaus jota Svea tukee.

source: Invalid number in payment method handling costs
fi: Laskutuslisälle on määriteltynä virheellinen suuruus

source: Payment method not selected
fi: Maksutapa puuttuu

source: Payment gateway not available.
fi: Maksukäytävä ei käytettävissä.

source: Missing reference number in response.
fi: Viite puuttuu vastauksessa.

source: Could not process order.
fi: Tilausta ei voitu käsitellä.

source: Error from Svea received.
fi: Svea palautti virheen.

source: Payment delayed by Svea.
fi: Viivästetty maksu Sveassa.

source: Cancellation from Svea received.
fi: Peruutettu Sveassa.

source: Payment confirmed by Svea.
fi: Svea varmensi maksun.

source: Surcharge from Payment Gateway
fi: Lisämaksu maksukäytävästä

source: Credit Card and Mobile
fi: Kortti- ja mobiilimaksut

source: General Svea settings are managed <a href="%s">here</a>.
fi: Yleisiä Svean maksutapojen asetuksia voi muokata <a href="%s">täällä</a>.

source: Invoice and Part Payment
fi: Lasku ja erämaksu

source: Online Bank Payments
fi: Verkkopankkimaksut

source: Other Payments
fi: Muut maksutavat

source: Estonia Payments
fi: Viron maksutavat

source: The payment is confirmed by Svea
fi: Maksu varmistettiin Sveassa

source: The payment is canceled by Svea
fi: Tilaus peruttiin Sveassa

source: The payment could not be confirmed by Svea, please check manually
fi: Tapahtui virhe eikä maksusuoritusta voitu vahvistaa. Varmista maksusuoritus manuaalisesti.

source: The payment is still waiting for confirmation by Svea
fi: Maksusuoritus odottaa vahvistusta

source: An error occurred and the payment was not confirmed.
fi: Maksamisessa tapahtui virhe.

source: Missing payment field(s) in response: "%s"
fi: Vastauksesta puuttuvat maksun tiedot: "%s"

source: The payment did not match any order
fi: Maksusuoritusta vastaavaa tilausta ei löydy

source: Payment verification checksum does not match
fi: Maksun tarkiste ei täsmää

source: Payment reference number could not be verified
fi: Yhtä tai useampaa tarkistetietoa ei voitu varmentaa

source: %s (obtained %s, expected %s)
fi: %s (saatiin %s, odotettiin %s)

source: The following field(s) differs from order: %s
fi: Seuraavat kentät eroavat tilauksesta: %s

source: Invalid payment amount (obtained %s, expected %s)
fi: Virheellinen maksun määrä (saatiin %s, odotettiin %s)

source: Made a refund of %s € through Svea
fi: Hyvitettiin %s € Svea maksupalvelussa

source: Creating a refund failed
fi: Hyvityksen luonti epäonnistui

source: Make a refund directly
fi: Tee tapahtuman hyvitys

source: in Svea Extranet
fi: Svea Extranetissä

source: Payment is already settled. A payment to Svea is required to finalize refund:
fi: Maksu on jo tilitetty. Hyvityksen suorittamiseksi maksajalle sinun pitää tehdä Svealle tilisiirto seuraavin tiedoin:

source: Recipient
fi: Maksun saaja

source: Reference
fi: Viitenumero

source: Amount
fi: Summa

source: Svea does not support your store currency. Only EUR is supported.
fi: Svea ei tue kaupan valuuttaa. Vain EUR on tuettu.

source: Thank you for your order. You will now be redirected to Svea to complete the payment.
fi: Kiitos tilauksestasi. Ohjaamme sinut nyt Svean sivuille maksamista varten.

source: Cancel order
fi: Peru tilaus

source: Pay for order
fi: Maksa tilaus

source: Pay with Svea
fi: Siirry maksamaan

source: Svea order details
fi: Svean tilauksen tiedot

source: Once every 5 minutes
fi: Joka viides minuutti

source: Settings
fi: Asetukset

source: WooCommerce Svea Payments Gateway
fi: Svean maksunvälityspalvelu

source: A plugin for Svea, which provides intelligent online payment services consisting of the most
fi: Svea on maksupalveluntarjoaja, jonka älykäs palvelukokonaisuus vastaa vaativankin verkkokaupan tarpeisiin.

source: Gift Card
fi: Lahjakortti

source: Failed to fetch payment methods from Svea
fi: Maksutapojen haku Svealta epäonnistui
